# col_list = [
#     "证券名称", "发行价", "高剔价格", "我司报价",
#     "少薮派1", "鹏华1", "华夏1", "九章1", "林园1",
#     "玄元1", "明汯", "宁波宁聚1", "宁波宁聚2", "伊洛1",
#     "南方1", "创金合信1", "安信1", "新华", "盘京1",
#     "一村", "久铭1", "涌津", "博时基金", "富国",
#     "工银瑞信", "国海富兰克林", "国联安", "国泰基金", "方圆达创",
#     "富善", "泰达宏利", "泰康资管", "鑫元基金", "易方达",
#     "招商财富资管", "招商证券资管", "中银基金", "中银基金1", "中意资管",
#     "广发基金", "汇添富", "银华", "景顺长城", "大成基金",
#     "通怡", "备注"
# ]

col_temp = [
    "类目", "全称", "价格", "备注"
]

# 注意优先级
state_dict = {
    "低": "低价剔除",
    "高": "高价剔除",
    "无": "无效报价",
    "有": "有效报价"
}

kcb_col = [
    "公司简称",
    "询价日",
    "网下投资者名称",
    "申购价格(元)",
    "报价结果"
]

cyb_col = [
    "名称",
    "询价日",
    "投资者名称",
    "申报价格（元/股）",
    "备注"
]

race_member_list = [
    "迎水投资", "少薮派", "鹏华", "华夏", "九章", "林园",
    "玄元", "明汯", "宁波宁聚", "伊洛", "南方", "创金合信",
    "安信", "新华", "盘京", "一村", "久铭", "涌津", "博时基金",
    "富国", "工银瑞信", "国海富兰克林", "国联安", "国泰基金",
    "方圆达创", "富善", "泰达宏利", "泰康资管", "鑫元基金", "易方达",
    "招商财富资管", "招商证券资管", "中银基金", "中意资管",
    "广发基金", "汇添富", "银华", "景顺长城", "大成基金", "通怡"
]

attention_dict = {
    "少薮派": "上海少薮派投资管理有限公司",
    "鹏华": "鹏华资产管理有限公司",
    "华夏": "华夏基金管理有限公司",
    "九章": "浙江九章资产管理有限公司",
    "林园": "深圳市林园投资管理有限责任公司",
    "玄元": "广州市玄元投资管理有限公司",
    "明汯": "上海明汯投资管理有限公司",
    "宁波宁聚": "宁波宁聚资产管理中心（有限合伙）",
    "伊洛": "河南伊洛投资管理有限公司",
    "南方": "南方基金管理股份有限公司",
    "创金合信": "创金合信基金管理有限公司",
    "安信基金": "安信基金管理有限责任公司",
    "新华": "新华基金管理股份有限公司",
    "盘京": "上海盘京投资管理中心（有限合伙）",
    "一村": "上海一村投资管理有限公司",
    "久铭": "上海久铭投资管理有限公司",
    "涌津": "上海涌津投资管理有限公司",
    "博时基金": "博时基金管理有限公司",
    "富国": "富国基金管理有限公司",
    "工银瑞信": "工银瑞信基金管理有限公司",
    "国海富兰克林": "国海富兰克林基金管理有限公司",
    "国联安": "国联安基金管理有限公司",
    "国泰基金": "国泰基金管理有限公司",
    "方圆达创": "上海方圆达创投资合伙企业（有限合伙）",
    "富善": "上海富善投资有限公司",
    "泰达宏利": "泰达宏利基金管理有限公司",
    "泰康资管": "泰康资产管理有限责任公司",
    "鑫元基金": "鑫元基金管理有限公司",
    "易方达": "易方达基金管理有限公司",
    "招商财富资管": "招商财富资产管理有限公司",
    "招商证券资管": "招商证券资产管理有限公司",
    "中银基金": "中银基金管理有限公司",
    "中意资管": "中意资产管理有限责任公司",
    "广发基金": "广发基金管理有限公司",
    "汇添富": "汇添富基金管理股份有限公司",
    "银华": "银华基金管理股份有限公司",
    "景顺长城": "景顺长城基金管理有限公司",
    "大成基金": "大成基金管理有限公司",
    "通怡": "上海通怡投资管理有限公司"
}
