# col_list = [
#     '证券名称', '发行价', '高剔价格', '我司报价',
#     '少薮派1', '鹏华1', '华夏1', '九章1', '林园1',
#     '玄元1', '明汯', '宁波宁聚1', '宁波宁聚2', '伊洛1',
#     '南方1', '创金合信1', '安信1', '新华', '盘京1',
#     '一村', '久铭1', '涌津', '博时基金', '富国',
#     '工银瑞信', '国海富兰克林', '国联安', '国泰基金', '方圆达创',
#     '富善', '泰达宏利', '泰康资管', '鑫元基金', '易方达',
#     '招商财富资管', '招商证券资管', '中银基金', '中银基金1', '中意资管',
#     '广发基金', '汇添富', '银华', '景顺长城', '大成基金',
#     '通怡', '备注'
# ]

col_temp = [
    "类目", "全称", "价格", "备注"
]

# 注意优先级
state_dict = {
    "低": "低价剔除",
    "高": "高价剔除",
    "无": "无效报价",
    "有": "有效报价"
}

kcb_col = [
    "公司简称",
    "询价日",
    "网下投资者名称",
    "申购价格(元)",
    "报价结果"
]

cyb_col = [
    "名称",
    "询价日",
    "投资者名称",
    "申报价格（元/股）",
    "备注"
]

race_member_list = [
    '迎水投资', '少薮派', '鹏华', '华夏', '九章', '林园',
    '玄元', '明汯', '宁波宁聚', '伊洛', '南方', '创金合信',
    '安信', '新华', '盘京', '一村', '久铭', '涌津', '博时基金',
    '富国', '工银瑞信', '国海富兰克林', '国联安', '国泰基金',
    '方圆达创', '富善', '泰达宏利', '泰康资管', '鑫元基金', '易方达',
    '招商财富资管', '招商证券资管', '中银基金', '中意资管',
    '广发基金', '汇添富', '银华', '景顺长城', '大成基金', '通怡'
]
